In [7]:
import pandas as pd
import os

In [3]:
df1 = pd.read_csv ("//ad.univ-lille.fr/Etudiants/Homedir3/287058/Documents/M2/MLOPS/MLOPS-TD1-23/donnéestd/restaurant_1_week_002.csv")

In [4]:
df1.head()

,Order Number,Order Date,Item Name,Quantity,Product Price,Total products
0,1388,2015-01-10 20:12:00,Onion Chutney,1,0.50,6
1,1388,2015-01-10 20:12:00,Mint Sauce,1,0.50,6
2,1388,2015-01-10 20:12:00,Lime Pickle,1,0.50,6
3,1388,2015-01-10 20:12:00,Paratha,1,2.95,6
4,1387,2015-01-10 16:55:00,Onion Bhaji,1,3.95,1

In [5]:
df2 = pd.read_csv ("//ad.univ-lille.fr/Etudiants/Homedir3/287058/Documents/M2/MLOPS/MLOPS-TD1-23/donnéestd/restaurant_1_week_007.csv")

In [6]:
df2.head()

,Order Number,Order Date,Item Name,Quantity,Product Price,Total products
0,1397,2015-02-10 14:38:00,Spicy Papadum,1,0.80,5
1,1403,2015-02-10 17:29:00,Paratha,1,2.95,9
2,1403,2015-02-10 17:29:00,Coke 1.5 ltr,1,2.95,9
3,1403,2015-02-10 17:29:00,Lemon Rice,1,3.95,9
4,1402,2015-02-10 16:39:00,Onion Bhaji,1,3.95,6

In [10]:
data_dir = '//ad.univ-lille.fr/Etudiants/Homedir3/287058/Documents/M2/MLOPS/MLOPS-TD1-23'
prefix = "restaurant_1"
start_week = 108
end_week = 110

df = pd.DataFrame()
for i in range (start_week, end_week+1):
    file_path = os.path.join(data_dir, "donnéestd" , f'{prefix}_week_{i}.csv')
    if os.path.isfile(file_path):
        batch = pd.read_csv(file_path)
        df = pd.concat([df, batch], sort = True)
df.head()

,Item Name,Order Date,Order Number,Product Price,Quantity,Total products
0,Mango Chutney,2017-01-28 19:14:00,4416,0.5,3,4
1,Mango Chutney,2017-01-28 18:41:00,4414,0.5,1,13
2,Mint Sauce,2017-01-28 18:41:00,4414,0.5,1,13
3,Mango Chutney,2017-01-28 18:28:00,4413,0.5,1,6
4,Mango Chutney,2017-01-28 12:32:00,4402,0.5,1,10

In [11]:
df

,Item Name,Order Date,Order Number,Product Price,Quantity,Total products
0,Mango Chutney,2017-01-28 19:14:00,4416,0.50,3,4
1,Mango Chutney,2017-01-28 18:41:00,4414,0.50,1,13
2,Mint Sauce,2017-01-28 18:41:00,4414,0.50,1,13
3,Mango Chutney,2017-01-28 18:28:00,4413,0.50,1,6
4,Mango Chutney,2017-01-28 12:32:00,4402,0.50,1,10
...,...,...,...,...,...,...
481,Tandoori Mixed Grill,2017-02-07 13:09:00,5900,11.95,1,8
482,Hazary Lamb Chilli Garlic,2017-02-10 17:38:00,6936,12.95,1,4
483,King Prawn Shaslick,2017-02-09 17:35:00,6590,12.95,1,4
484,Bhuna,2017-02-08 18:16:00,6249,12.95,1,9
485,House Red wine 75cl,2017-02-10 17:38:00,6936,17.95,2,4